--liquibase formatted sql
--changeset {Afler}:{insertLocations}

INSERT INTO city (id, name)
VALUES
    (1, 'Самара'),
    (2, 'Москва'),
    (3, 'Санкт-Петербург');

INSERT INTO location (id, name, category, latitude, longitude, rating, rating_num, city_id)
VALUES
    (1, 'Парк Гагарина', 'NATURE', '53.230383', '50.206045', '0', '0', 1),
    (2, 'Ладья', 'ARCHITECTURE', '53.215937', '50.132186', '0', '0', 1),
    (3, 'Монумент славы', 'ARCHITECTURE', '53.203812', '50.109916', '0', '0', 1),
    (4, 'ЖД вокзал', 'ARCHITECTURE', '53.185844', '50.121749', '0', '0', 1),

    (5, 'Кремль', 'HISTORY', '55.751426', '37.618879', '0', '0', 2),
    (6, 'Парящий мост', 'ARCHITECTURE', '55.749489', '37.629482', '0', '0', 2),
    (7, 'Большой театр', 'CULTURE', '55.760435', '37.619034', '0', '0', 2),

    (8, 'Эрмитаж', 'CULTURE', '59.940419', '30.313822', '0', '0', 3),
    (9, 'Мариинский театр', 'CULTURE', '59.925255', '30.287792', '0', '0', 3),
    (10, 'Петропавловская крепость', 'HISTORY', '59.950001', '30.315007', '0', '0', 3)
